<<<<<<< HEAD
#@+leo-ver=5-thin
#@+node:lee.20141224110313.58: * @file asciisymbol.py
#@@language python
#@@tabwidth -4
# -*- coding: utf-8 -*-


#@+others
#@+node:lee.20141227235536.6: ** symbolSpace
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbolSpace(row):
    s = [
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
        '■■■■■■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.7: ** symbol1
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol1 (row):
    s=[
        '■■■□■■■',
        '■■□□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■□□□□□□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.8: ** symbol2
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol2 (row):
    s=[
        '■□□□□□■',
        '■□■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■■□□□□□',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.9: ** symbol3
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol3 (row):
    s=[
        '■□□□□□■',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■□□□□□■',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■□□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.10: ** symbol4
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol4 (row):
    s=[
        '■■■■■□■',
        '■■■■□□■',
        '■■■□■□■',
        '■■□■■□■',
        '■□■■■□■',
        '■□□□□□□',
        '■■■■■□■',
        '■■■■■□■',
        '■■■■■□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.11: ** symbol5
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol5 (row):
    s=[
        '■□□□□□□',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□■',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■□□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.12: ** symbol6
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol6 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.13: ** symbol7
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol7 (row):
    s=[
        '■□□□□□□',
        '■□■■■■□',
        '■■■■■■□',
        '■■■■■□■',
        '■■■■□■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.14: ** symbol8
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol8 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.15: ** symbol9
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol9 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□□',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.16: ** symbol10
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol10 (row):
    s=[
        '■■□□□□■',
        '■□■■■□□',
        '■□■■■□□',
        '■□■■□■□',
        '■□■□□■□',
        '■□■□■■□',
        '■□□■■■□',
        '■□□■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.17: ** symbol11
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol11 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□□□□□□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.18: ** symbol12
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol12 (row):
    s=[
        '■□□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.19: ** symbol13
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol13 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.20: ** symbol14
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol14 (row):
    s=[
        '■□□□□■■',
        '■□■■■□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■□■',
        '■□□□□■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.21: ** symbol15
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol15 (row):
    s=[
        '■□□□□□□',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.22: ** symbol16
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol16 (row):
    s=[
        '■□□□□□□',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.23: ** symbol17
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol17 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■□□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.24: ** symbol18
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol18 (row):
    s=[
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□□□□□□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.25: ** symbol19
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol19 (row):
    s=[
        '■□□□□□□',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■□□□□□□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.26: ** symbol20
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol20 (row):
    s=[
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■■■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.27: ** symbol21
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol21 (row):
    s=[
        '■□■■■■□',
        '■□■■■□■',
        '■□■■□■■',
        '■□■□■■■',
        '■□□■■■■',
        '■□■□■■■',
        '■□■■□■■',
        '■□■■■□■',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.28: ** symbol22
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol22 (row):
    s=[
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□□□□□□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.29: ** symbol23
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol23 (row):
    s=[
        '■□■■■■□',
        '■□□■■□□',
        '■□□□□□□',
        '■□■□□■□',
        '■□■□□■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.30: ** symbol24
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol24 (row):
    s=[
        '■□■■■■□',
        '■□□■■■□',
        '■□□□■■□',
        '■□■□■■□',
        '■□■□□■□',
        '■□■■□■□',
        '■□■■□□□',
        '■□■■■□□',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.31: ** symbol25
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol25 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.32: ** symbol26
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol26 (row):
    s=[
        '■□□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□□□□□■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
        '■□■■■■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.33: ** symbol27
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol27 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■□■□',
        '■□■■■□□',
        '■■□□□□□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.34: ** symbol28
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol28 (row):
    s=[
        '■□□□□□■',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□□□□□■',
        '■□■■□■■',
        '■□■■■□■',
        '■□■■■■□',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.35: ** symbol29
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol29 (row):
    s=[
        '■■□□□□■',
        '■□■■■■□',
        '■□■■■■■',
        '■□■■■■■',
        '■■□□□□■',
        '■■■■■■□',
        '■■■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.36: ** symbol30
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol30 (row):
    s=[
        '■□□□□□□',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.37: ** symbol31
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol31 (row):
    s=[
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□□□□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.38: ** symbol32
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol32 (row):
    s=[
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□■■□■',
        '■■□■■□■',
        '■■■□□■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.39: ** symbol33
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol33 (row):
    s=[
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■□■□□■□',
        '■□■□□■□',
        '■□■□□■□',
        '■□□□□□□',
        '■■□■■□■',
        '■■□■■□■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.40: ** symbol34
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol34 (row):
    s=[
        '■□■■■■□',
        '■□■■■■□',
        '■■□■■□■',
        '■■■□□■■',
        '■■■□□■■',
        '■■■□□■■',
        '■■□■■□■',
        '■□■■■■□',
        '■□■■■■□',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.41: ** symbol35
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol35 (row):
    s=[
        '■□■■■■□',
        '■□■■■■□',
        '■□■■■■□',
        '■■□■■□■',
        '■■■□□■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
        '■■■□■■■',
    ]
    return s[row]

<<<<<<< HEAD
#@+node:lee.20141227235536.42: ** symbol36
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
def symbol36 (row):
    s=[
        '■□□□□□□',
        '■■■■■■□',
        '■■■■■□□',
        '■■■■□□■',
        '■■■□□■■',
        '■■□□■■■',
        '■□□■■■■',
        '■□■■■■■',
        '■□□□□□□',
    ]
    return s[row]





<<<<<<< HEAD
#@+node:lee.20141227235536.44: ** symbolDict(dictionary)
=======
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
symbolDict={
    "1":symbol1, "2":symbol2, "3":symbol3, "4":symbol4,
    "5": symbol5, "6": symbol6, "7":symbol7, "8":symbol8, "9":symbol9,
    "0": symbol10, "A": symbol11, "B": symbol12, "C": symbol13, "D": symbol14,
    "E": symbol15, "F": symbol16, "G": symbol17, "H": symbol18, "I": symbol19,
    "J": symbol20, "K": symbol21, "L": symbol22, "M": symbol23, "N": symbol24,
    "O": symbol25, "P": symbol26, "Q": symbol27, "R": symbol28, "S": symbol29,
    "T": symbol30, "U": symbol31, "V": symbol32, "W": symbol33, "X": symbol34,
    "Y": symbol35, "Z": symbol36, "": symbolSpace,
}
<<<<<<< HEAD
#@+node:lee.20141227235536.43: ** def asciiImage
def asciiImage(inp):
    """
    字串轉成圖案, 回傳內容為 HTML 格式
    """
=======

def asciiImage(inp):
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
    if inp == '':
        return ''
    row = 9

    content = ""
    
    # convert to upper case
    try:
        inp = inp.upper()
    except:
        pass

    # loop string
    for r in range(row):
        for c in inp:
            # get the symbol
            out_symbol = symbolDict.get(c, symbolDict[""])(r)
            content += out_symbol
        content += "<br />"
<<<<<<< HEAD
    return content
#@-others
#@-leo
=======
    return content
>>>>>>> 371e1e3daebd7e80edd924d580544ab7a3ba13bb
